tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "ngrok/ngrok"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Improved top (interactive process viewer)
brew "htop"
# Rainbows and unicorns in your console!
brew "lolcat"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# GPU-accelerated terminal emulator
cask "alacritty"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
